
## Plan Result (stg)




<pre><code>Plan: 3 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.apim_subscription_editvm_primary_key[0]
  * azurerm_key_vault_secret.apim_subscription_editvm_secondary_key[0]
  * module.apim_subscription_editvm[0].azurerm_api_management_subscription.subscription
* Update
  * module.apim_subscription_portal[0].azurerm_api_management_subscription.subscription
  * module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription
  * module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.apim_subscription_editvm_primary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_editvm_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg"
      + name                    = "apim-sub-editvm-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.apim_subscription_editvm_secondary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_editvm_secondary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg"
      + name                    = "apim-sub-editvm-secondary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.apim_subscription_editvm[0].azurerm_api_management_subscription.subscription will be created
  + resource "azurerm_api_management_subscription" "subscription" {
      + allow_tracing       = true
      + api_management_name = "sds-api-mgmt-stg"
      + display_name        = "PRE Edit VM subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + resource_group_name = "ss-stg-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # module.apim_subscription_portal[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/500e642d-76ef-4d82-8741-bf9e9d979705"
        # (10 unchanged attributes hidden)
    }

  # module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/37f73c17-345b-4c67-81d5-50d582e97227"
        # (10 unchanged attributes hidden)
    }

  # module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/da1d82f9-7187-4cb6-a6dd-b0020311f3bb"
        # (10 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":658,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->